2017-04-20-Annoying-prefix-argument.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-08 Wed 15:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Annoying prefix argument</title>
<meta name="author" content="Matúš Goljer" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="css/blog.css" />
</head>
<body>
<div id="preamble" class="status">

<div style="text-align: left; float: left;">
  <a href="./index.html">Home</a>
  <a href="https://github.com/Fuco1/">GitHub</a>
  <a href="https://www.patreon.com/user?u=3282358">Patreon</a>
</div>
<div style="text-align: right;">
  <a href="https://github.com/Fuco1/Fuco1.github.io/discussions">Discussions</a>
  <a href="https://fuco1.github.io/rss.xml">RSS</a>
  <a href="https://twitter.com/Fuco1337">Twitter</a>
</div>
<hr />
</div>
<div id="content" class="content">
<h1 class="title">Annoying prefix argument</h1>

<div id="outline-container-org4c31705" class="outline-2">
<h2 id="org4c31705">Problem</h2>
<div class="outline-text-2" id="text-org4c31705">
<p>
A prefix argument changes the behaviour of a command in a way which forms a useful stand-alone command.  We don't want to supply the command with the prefix argument all the time.
</p>
</div>
</div>

<div id="outline-container-org1dd1248" class="outline-2">
<h2 id="org1dd1248">Solution</h2>
<div class="outline-text-2" id="text-org1dd1248">
<p>
Write an interactive wrapper and pre-fill the arguments
</p>
</div>
</div>

<div id="outline-container-org3d65b8c" class="outline-2">
<h2 id="org3d65b8c">Motivation</h2>
<div class="outline-text-2" id="text-org3d65b8c">
<p>
It is awkward and annoying to constantly use prefix-arguments for commonly used operations.  Emacs has a rich history of commands using prefix arguments to subtly (or not so subtly) modify the behaviour of the base command.  If you often use a specialized variant you can save yourself a lot of pain by simply building a specialized solution.  It is not uncommon to see two prefix arguments (<kbd>C-u C-u</kbd>), but I've seen four and even five once or twice.
</p>
</div>
</div>

<div id="outline-container-orge3f2e61" class="outline-2">
<h2 id="orge3f2e61">Example</h2>
<div class="outline-text-2" id="text-orge3f2e61">
<p>
Emacs comes with this amazing functionality called <i>marks</i>.  They act a bit like "automatic" bookmarks within the current buffer (there is also a global version but I won't go into that right now).  Marks live in the <i>mark ring</i><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.  This allows you to remember multiple marks at the same time and recall them in a lifo order.
</p>

<p>
When you move around the buffer, Emacs pushes the position where you started from to the mark ring and lets you jump back by popping the mark.
</p>

<p>
Most commands which move the point, like <code>isearch</code>, <code>beginning-of-buffer</code>, <code>imenu</code>, <code>next-defun</code> set the mark in somewhat intelligent way.  For example, if you call <code>next-defun</code> multiple times it pushes the mark only when you call it for the first time.  That way, when you recall the mark you jump to the "original" defun five functions up without having to recall five times.
</p>

<p>
This is all good and well, but dealing with marks turned out rather frustrating for me.  The most common action, namely recalling the mark, is bound to arather awkward <kbd>C-u C-SPC</kbd>.  It doesn't help in the least that the command is called <code>set-mark-command</code>, in fact, the same command you use to <i>set</i> the mark, just with a prefix argument.
</p>

<p>
Here we can identify a rather common Emacs annoyance: prefix argument changes the behaviour of a command into something completely different; but we want to use both versions in a simple way!
</p>

<p>
How can we solve this?  We write our own interactive wrapper!
</p>
</div>
</div>
<div id="outline-container-org762297f" class="outline-2">
<h2 id="org762297f">Resolution</h2>
<div class="outline-text-2" id="text-org762297f">
<p>
First we need to figure out which argument and with what value we will need to pre-fill.  Most of the time reading the documentation with <kbd>C-h f</kbd> will be enough to give us a clue, but sometimes inspecting the source is the only way to be sure.
</p>

<p>
In our example, we know that we call the function with <kbd>C-u</kbd> which corresponds to Elisp value <code>(4)</code> (that is a list with 4 in it).  Each extra <code>C-u</code> multiplies the number in the list by 4.  There is only one argument to the function <code>set-mark-command</code> so that's the position we will need to fill.  The result is then the following function.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">my-jump-to-mark</span> <span style="color: #888a85;">()</span>
  <span style="color: #e9b96e;">"Jump to the local mark, respecting the `</span><span style="color: #e6a8df;">mark-ring</span><span style="color: #e9b96e;">' order.</span>
<span style="color: #e9b96e;">This is the same as using \\[</span><span style="color: #e6a8df;">set-mark-command</span><span style="color: #e9b96e;">] with the prefix argument."</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">interactive</span><span style="color: #888a85;">)</span>
  <span style="color: #888a85;">(</span>set-mark-command '<span style="color: #888a85;">(</span>4<span style="color: #888a85;">)))</span>
</pre>
</div>

<p>
We can bind this command to a simple key binding, for example
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span>global-set-key <span style="color: #888a85;">(</span>kbd <span style="color: #e9b96e;">"M-`"</span><span style="color: #888a85;">)</span> <span style="color: #e6a8df;">'my-jump-to-mark</span><span style="color: #888a85;">)</span>
</pre>
</div>

<p>
Sometimes, the prefix argument isn't passed as an argument but is read from a special variable <code>current-prefix-arg</code>.  When you call a command using a prefix argument, Emacs automatically sets this variable to the corresponding Elisp value.
</p>

<p>
Before we continue, a little excursion into how Emacs maintains value bindings.  When you use <code>let</code> to set the value of a special variable<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>, this value becomes current until the execution of the <code>let</code> block is finished.  This means that this value is available globally for all the subroutines called from the let block, as well as for all the subroutines called from these and so on.
</p>

<p>
Armed with this knowledge, we can try it on an example.  The comand <code>align-regexp</code> changes the meaning of its 3rd argument based on the value of the special variable <code>current-prefix-arg</code>.  We will write an interactive wrapper which we will call without any prefix argument.  This means Emacs will set the value of <code>current-prefix-arg</code> to <code>nil</code>.  We will use dynamic binding to set the value to <code>(4)</code> and then call the original function.
</p>

<p>
Because we want to respect the interactive behaviour of the original function we will use <code>call-interactively</code> which calls the function providing arguments according to its interactive calling specification.
</p>

<p>
The result is then quite simple again.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">my-align-regexp</span> <span style="color: #888a85;">()</span>
  <span style="color: #e9b96e;">"Call `</span><span style="color: #e6a8df;">align-regexp</span><span style="color: #e9b96e;">' with `</span><span style="color: #e6a8df;">current-prefix-arg</span><span style="color: #e9b96e;">' set to (4)."</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">interactive</span><span style="color: #888a85;">)</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">let</span> <span style="color: #888a85;">((</span>current-prefix-arg '<span style="color: #888a85;">(</span>4<span style="color: #888a85;">)))</span>
    <span style="color: #888a85;">(</span>call-interactively <span style="color: #e6a8df;">'align-regexp</span><span style="color: #888a85;">)))</span>
</pre>
</div>

<p>
Notice that we could have used this technique in the first example as well, because the interactive specifications <code>"p"</code> and <code>"P"</code> simply check the value of <code>current-prefix-arg</code> and pass it forward.  The code would look like so:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">my-jump-to-mark-2</span> <span style="color: #888a85;">()</span>
  <span style="color: #e9b96e;">"Jump to the local mark, respecting the `</span><span style="color: #e6a8df;">mark-ring</span><span style="color: #e9b96e;">' order.</span>
<span style="color: #e9b96e;">This is the same as using \\[</span><span style="color: #e6a8df;">set-mark-command</span><span style="color: #e9b96e;">] with the prefix argument."</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">interactive</span><span style="color: #888a85;">)</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">let</span> <span style="color: #888a85;">((</span>current-prefix-arg '<span style="color: #888a85;">(</span>4<span style="color: #888a85;">)))</span>
    <span style="color: #888a85;">(</span>call-interactively <span style="color: #e6a8df;">'set-mark-command</span><span style="color: #888a85;">)))</span>
</pre>
</div>

<p>
We can't, however, use the first method on <code>align-regexp</code> because none of its arguments directly corresponds to the prefix argument&#x2014;it is only inside the body that this is checked.
</p>

<p>
The moral of the story is that we should always prefer passing the argument directly as it is cleaner and less magical.  Only if the prefix argument is not direct but checked inside the body of the function we shall use dynamic binding.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">A ring in Emacs is basically a stack where popped elements go to the bottom</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">A variable is <i>special</i> if defined using <code>defvar</code>.</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<hr />
<div style="text-align: left; float: left;">Published at: 2017-04-20 21:49 Last updated at: 2023-02-08 15:59</div>
<div style="text-align: right;">Found a typo? <a href="https://github.com/Fuco1/fuco1.github.io/blob/master/posts/2017-04-20-Annoying-prefix-argument.org">Edit on GitHub!</a></div>
</div>
</body>
</html>